china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_rc.h
// field definitions
#define RC_TRX_REG1_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG1_LSB    0
#define RC_TRX_REG1_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG1_RST    0x0

__INLINE uint32_t rc_trx_reg1_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg1_setf(uint32_t trxreg1)
{
    ASSERT_ERR((((uint32_t)trxreg1 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG1_ADDR, (uint32_t)trxreg1 << 0);
}

/**
 * @brief TRX_REG2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG2   0x0
 * </pre>
 */
#define RC_TRX_REG2_ADDR   (REG_RC_BASE_ADDR + 0x00000088)
#define RC_TRX_REG2_OFFSET 0x00000088
#define RC_TRX_REG2_INDEX  0x00000022
#define RC_TRX_REG2_RESET  0x00000000

__INLINE uint32_t rc_trx_reg2_get(void)
{
    return REG_PL_RD(RC_TRX_REG2_ADDR);
}

__INLINE void rc_trx_reg2_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG2_ADDR, value);
}

// field definitions
#define RC_TRX_REG2_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG2_LSB    0
#define RC_TRX_REG2_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG2_RST    0x0

__INLINE uint32_t rc_trx_reg2_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg2_setf(uint32_t trxreg2)
{
    ASSERT_ERR((((uint32_t)trxreg2 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG2_ADDR, (uint32_t)trxreg2 << 0);
}

/**
 * @brief TRX_REG3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG3   0x0
 * </pre>
 */
#define RC_TRX_REG3_ADDR   (REG_RC_BASE_ADDR + 0x0000008C)
#define RC_TRX_REG3_OFFSET 0x0000008C
#define RC_TRX_REG3_INDEX  0x00000023
#define RC_TRX_REG3_RESET  0x00000000

__INLINE uint32_t rc_trx_reg3_get(void)
{
    return REG_PL_RD(RC_TRX_REG3_ADDR);
}

__INLINE void rc_trx_reg3_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG3_ADDR, value);
}

// field definitions
#define RC_TRX_REG3_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG3_LSB    0
#define RC_TRX_REG3_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG3_RST    0x0

__INLINE uint32_t rc_trx_reg3_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG3_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg3_setf(uint32_t trxreg3)
{
    ASSERT_ERR((((uint32_t)trxreg3 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG3_ADDR, (uint32_t)trxreg3 << 0);
}

/**
 * @brief TRX_REG4 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG4   0x0
 * </pre>
 */
#define RC_TRX_REG4_ADDR   (REG_RC_BASE_ADDR + 0x00000090)
#define RC_TRX_REG4_OFFSET 0x00000090
#define RC_TRX_REG4_INDEX  0x00000024
#define RC_TRX_REG4_RESET  0x00000000

__INLINE uint32_t rc_trx_reg4_get(void)
{
    return REG_PL_RD(RC_TRX_REG4_ADDR);
}

__INLINE void rc_trx_reg4_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG4_ADDR, value);
}

// field definitions
#define RC_TRX_REG4_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG4_LSB    0
#define RC_TRX_REG4_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG4_RST    0x0

__INLINE uint32_t rc_trx_reg4_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG4_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg4_setf(uint32_t trxreg4)
{
    ASSERT_ERR((((uint32_t)trxreg4 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG4_ADDR, (uint32_t)trxreg4 << 0);
}

/**
 * @brief TRX_REG5 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG5   0x0
 * </pre>
 */
#define RC_TRX_REG5_ADDR   (REG_RC_BASE_ADDR + 0x00000094)
#define RC_TRX_REG5_OFFSET 0x00000094
#define RC_TRX_REG5_INDEX  0x00000025
#define RC_TRX_REG5_RESET  0x00000000

__INLINE uint32_t rc_trx_reg5_get(void)
{
    return REG_PL_RD(RC_TRX_REG5_ADDR);
}

__INLINE void rc_trx_reg5_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG5_ADDR, value);
}

// field definitions
#define RC_TRX_REG5_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG5_LSB    0
#define RC_TRX_REG5_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG5_RST    0x0

__INLINE uint32_t rc_trx_reg5_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG5_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg5_setf(uint32_t trxreg5)
{
    ASSERT_ERR((((uint32_t)trxreg5 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG5_ADDR, (uint32_t)trxreg5 << 0);
}

/**
 * @brief TRX_REG6 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG6   0x0
 * </pre>
 */
#define RC_TRX_REG6_ADDR   (REG_RC_BASE_ADDR + 0x00000098)
#define RC_TRX_REG6_OFFSET 0x00000098
#define RC_TRX_REG6_INDEX  0x00000026
#define RC_TRX_REG6_RESET  0x00000000

__INLINE uint32_t rc_trx_reg6_get(void)
{
    return REG_PL_RD(RC_TRX_REG6_ADDR);
}

__INLINE void rc_trx_reg6_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG6_ADDR, value);
}

// field definitions
#define RC_TRX_REG6_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG6_LSB    0
#define RC_TRX_REG6_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG6_RST    0x0

__INLINE uint32_t rc_trx_reg6_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG6_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg6_setf(uint32_t trxreg6)
{
    ASSERT_ERR((((uint32_t)trxreg6 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG6_ADDR, (uint32_t)trxreg6 << 0);
}

/**
 * @brief TRX_REG7 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TRX_REG7   0x0
 * </pre>
 */
#define RC_TRX_REG7_ADDR   (REG_RC_BASE_ADDR + 0x0000009C)
#define RC_TRX_REG7_OFFSET 0x0000009C
#define RC_TRX_REG7_INDEX  0x00000027
#define RC_TRX_REG7_RESET  0x00000000

__INLINE uint32_t rc_trx_reg7_get(void)
{
    return REG_PL_RD(RC_TRX_REG7_ADDR);
}

