china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_rc.h
// field definitions
#define RC_TRX_REG13_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG13_LSB    0
#define RC_TRX_REG13_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG13_RST    0x0

__INLINE uint32_t rc_trx_reg13_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG13_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg13_setf(uint32_t trxreg13)
{
    ASSERT_ERR((((uint32_t)trxreg13 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG13_ADDR, (uint32_t)trxreg13 << 0);
}

/**
 * @brief TRX_REG14 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG14   0x0
 * </pre>
 */
#define RC_TRX_REG14_ADDR   (REG_RC_BASE_ADDR + 0x000000B8)
#define RC_TRX_REG14_OFFSET 0x000000B8
#define RC_TRX_REG14_INDEX  0x0000002E
#define RC_TRX_REG14_RESET  0x00000000

__INLINE uint32_t rc_trx_reg14_get(void)
{
    return REG_PL_RD(RC_TRX_REG14_ADDR);
}

__INLINE void rc_trx_reg14_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG14_ADDR, value);
}

// field definitions
#define RC_TRX_REG14_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG14_LSB    0
#define RC_TRX_REG14_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG14_RST    0x0

__INLINE uint32_t rc_trx_reg14_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG14_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg14_setf(uint32_t trxreg14)
{
    ASSERT_ERR((((uint32_t)trxreg14 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG14_ADDR, (uint32_t)trxreg14 << 0);
}

/**
 * @brief TRX_REG15 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG15   0x0
 * </pre>
 */
#define RC_TRX_REG15_ADDR   (REG_RC_BASE_ADDR + 0x000000BC)
#define RC_TRX_REG15_OFFSET 0x000000BC
#define RC_TRX_REG15_INDEX  0x0000002F
#define RC_TRX_REG15_RESET  0x00000000

__INLINE uint32_t rc_trx_reg15_get(void)
{
    return REG_PL_RD(RC_TRX_REG15_ADDR);
}

__INLINE void rc_trx_reg15_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG15_ADDR, value);
}

// field definitions
#define RC_TRX_REG15_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG15_LSB    0
#define RC_TRX_REG15_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG15_RST    0x0

__INLINE uint32_t rc_trx_reg15_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG15_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg15_setf(uint32_t trxreg15)
{
    ASSERT_ERR((((uint32_t)trxreg15 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG15_ADDR, (uint32_t)trxreg15 << 0);
}

/**
 * @brief TRX_REG16 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG16   0x0
 * </pre>
 */
#define RC_TRX_REG16_ADDR   (REG_RC_BASE_ADDR + 0x000000C0)
#define RC_TRX_REG16_OFFSET 0x000000C0
#define RC_TRX_REG16_INDEX  0x00000030
#define RC_TRX_REG16_RESET  0x00000000

__INLINE uint32_t rc_trx_reg16_get(void)
{
    return REG_PL_RD(RC_TRX_REG16_ADDR);
}

__INLINE void rc_trx_reg16_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG16_ADDR, value);
}

// field definitions
#define RC_TRX_REG16_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG16_LSB    0
#define RC_TRX_REG16_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG16_RST    0x0

__INLINE uint32_t rc_trx_reg16_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG16_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg16_setf(uint32_t trxreg16)
{
    ASSERT_ERR((((uint32_t)trxreg16 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG16_ADDR, (uint32_t)trxreg16 << 0);
}

/**
 * @brief TRX_REG17 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG17   0x0
 * </pre>
 */
#define RC_TRX_REG17_ADDR   (REG_RC_BASE_ADDR + 0x000000C4)
#define RC_TRX_REG17_OFFSET 0x000000C4
#define RC_TRX_REG17_INDEX  0x00000031
#define RC_TRX_REG17_RESET  0x00000000

__INLINE uint32_t rc_trx_reg17_get(void)
{
    return REG_PL_RD(RC_TRX_REG17_ADDR);
}

__INLINE void rc_trx_reg17_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG17_ADDR, value);
}

// field definitions
#define RC_TRX_REG17_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG17_LSB    0
#define RC_TRX_REG17_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG17_RST    0x0

__INLINE uint32_t rc_trx_reg17_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG17_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg17_setf(uint32_t trxreg17)
{
    ASSERT_ERR((((uint32_t)trxreg17 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG17_ADDR, (uint32_t)trxreg17 << 0);
}

/**
 * @brief TRX_REG18 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG18   0x0
 * </pre>
 */
#define RC_TRX_REG18_ADDR   (REG_RC_BASE_ADDR + 0x000000C8)
#define RC_TRX_REG18_OFFSET 0x000000C8
#define RC_TRX_REG18_INDEX  0x00000032
#define RC_TRX_REG18_RESET  0x00000000

__INLINE uint32_t rc_trx_reg18_get(void)
{
    return REG_PL_RD(RC_TRX_REG18_ADDR);
}

__INLINE void rc_trx_reg18_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG18_ADDR, value);
}

// field definitions
#define RC_TRX_REG18_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_TRX_REG18_LSB    0
#define RC_TRX_REG18_WIDTH  ((uint32_t)0x00000020)

#define RC_TRX_REG18_RST    0x0

__INLINE uint32_t rc_trx_reg18_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_REG18_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_trx_reg18_setf(uint32_t trxreg18)
{
    ASSERT_ERR((((uint32_t)trxreg18 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_TRX_REG18_ADDR, (uint32_t)trxreg18 << 0);
}

/**
 * @brief TRX_REG19 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            TRX_REG19   0x0
 * </pre>
 */
#define RC_TRX_REG19_ADDR   (REG_RC_BASE_ADDR + 0x000000CC)
#define RC_TRX_REG19_OFFSET 0x000000CC
#define RC_TRX_REG19_INDEX  0x00000033
#define RC_TRX_REG19_RESET  0x00000000

__INLINE uint32_t rc_trx_reg19_get(void)
{
    return REG_PL_RD(RC_TRX_REG19_ADDR);
}

__INLINE void rc_trx_reg19_set(uint32_t value)
{
    REG_PL_WR(RC_TRX_REG19_ADDR, value);
}

