china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_rc.h
    *txiqswap = (localVal & ((uint32_t)0x80000000)) >> 31;
    *iqconstantpout = (localVal & ((uint32_t)0x7FE00000)) >> 21;
    *txpregain = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *iqconstantiqcalp = (localVal & ((uint32_t)0x0000FFC0)) >> 6;
}

__INLINE uint8_t rc_tx_iq_swap_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_OTHER_CFG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rc_tx_iq_swap_setf(uint8_t txiqswap)
{
    ASSERT_ERR((((uint32_t)txiqswap << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR, (REG_PL_RD(RC_TX_OTHER_CFG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txiqswap << 31));
}

__INLINE uint16_t rc_iq_constant_pout_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_OTHER_CFG_ADDR);
    return ((localVal & ((uint32_t)0x7FE00000)) >> 21);
}

__INLINE void rc_iq_constant_pout_setf(uint16_t iqconstantpout)
{
    ASSERT_ERR((((uint32_t)iqconstantpout << 21) & ~((uint32_t)0x7FE00000)) == 0);
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR, (REG_PL_RD(RC_TX_OTHER_CFG_ADDR) & ~((uint32_t)0x7FE00000)) | ((uint32_t)iqconstantpout << 21));
}

__INLINE uint8_t rc_tx_pre_gain_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_OTHER_CFG_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void rc_tx_pre_gain_setf(uint8_t txpregain)
{
    ASSERT_ERR((((uint32_t)txpregain << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR, (REG_PL_RD(RC_TX_OTHER_CFG_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)txpregain << 16));
}

__INLINE uint16_t rc_iq_constant_iqcal_p_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TX_OTHER_CFG_ADDR);
    return ((localVal & ((uint32_t)0x0000FFC0)) >> 6);
}

__INLINE void rc_iq_constant_iqcal_p_setf(uint16_t iqconstantiqcalp)
{
    ASSERT_ERR((((uint32_t)iqconstantiqcalp << 6) & ~((uint32_t)0x0000FFC0)) == 0);
    REG_PL_WR(RC_TX_OTHER_CFG_ADDR, (REG_PL_RD(RC_TX_OTHER_CFG_ADDR) & ~((uint32_t)0x0000FFC0)) | ((uint32_t)iqconstantiqcalp << 6));
}

/**
 * @brief AGC_CFG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         AGC_MAP_MODE   0
 *  30:29           AGC_LNA_RD   0x0
 *     28           AGC_BUF_RD   0
 *  27:24           AGC_PGA_RD   0x0
 *  23:16              TSSI_RD   0x0
 *  15:14           ST_SAR_ADC   0x1
 *  13:12            ST_RX_ADC   0x1
 *  11:10              TX_DC_N   0x1
 *     09              DSEL_VA   0
 *  08:01         TSSI_POUT_TH   0x40
 *     00         ST_RX_ADC_IQ   0
 * </pre>
 */
#define RC_AGC_CFG_ADDR   (REG_RC_BASE_ADDR + 0x00000150)
#define RC_AGC_CFG_OFFSET 0x00000150
#define RC_AGC_CFG_INDEX  0x00000054
#define RC_AGC_CFG_RESET  0x00005480

__INLINE uint32_t rc_agc_cfg_get(void)
{
    return REG_PL_RD(RC_AGC_CFG_ADDR);
}

__INLINE void rc_agc_cfg_set(uint32_t value)
{
    REG_PL_WR(RC_AGC_CFG_ADDR, value);
}

// field definitions
#define RC_AGC_MAP_MODE_BIT    ((uint32_t)0x80000000)
#define RC_AGC_MAP_MODE_POS    31
#define RC_AGC_LNA_RD_MASK     ((uint32_t)0x60000000)
#define RC_AGC_LNA_RD_LSB      29
#define RC_AGC_LNA_RD_WIDTH    ((uint32_t)0x00000002)
#define RC_AGC_BUF_RD_BIT      ((uint32_t)0x10000000)
#define RC_AGC_BUF_RD_POS      28
#define RC_AGC_PGA_RD_MASK     ((uint32_t)0x0F000000)
#define RC_AGC_PGA_RD_LSB      24
#define RC_AGC_PGA_RD_WIDTH    ((uint32_t)0x00000004)
#define RC_TSSI_RD_MASK        ((uint32_t)0x00FF0000)
#define RC_TSSI_RD_LSB         16
#define RC_TSSI_RD_WIDTH       ((uint32_t)0x00000008)
#define RC_ST_SAR_ADC_MASK     ((uint32_t)0x0000C000)
#define RC_ST_SAR_ADC_LSB      14
#define RC_ST_SAR_ADC_WIDTH    ((uint32_t)0x00000002)
#define RC_ST_RX_ADC_MASK      ((uint32_t)0x00003000)
#define RC_ST_RX_ADC_LSB       12
#define RC_ST_RX_ADC_WIDTH     ((uint32_t)0x00000002)
#define RC_TX_DC_N_MASK        ((uint32_t)0x00000C00)
#define RC_TX_DC_N_LSB         10
#define RC_TX_DC_N_WIDTH       ((uint32_t)0x00000002)
#define RC_DSEL_VA_BIT         ((uint32_t)0x00000200)
#define RC_DSEL_VA_POS         9
#define RC_TSSI_POUT_TH_MASK   ((uint32_t)0x000001FE)
#define RC_TSSI_POUT_TH_LSB    1
#define RC_TSSI_POUT_TH_WIDTH  ((uint32_t)0x00000008)
#define RC_ST_RX_ADC_IQ_BIT    ((uint32_t)0x00000001)
#define RC_ST_RX_ADC_IQ_POS    0

#define RC_AGC_MAP_MODE_RST    0x0
#define RC_AGC_LNA_RD_RST      0x0
#define RC_AGC_BUF_RD_RST      0x0
#define RC_AGC_PGA_RD_RST      0x0
#define RC_TSSI_RD_RST         0x0
#define RC_ST_SAR_ADC_RST      0x1
#define RC_ST_RX_ADC_RST       0x1
#define RC_TX_DC_N_RST         0x1
#define RC_DSEL_VA_RST         0x0
#define RC_TSSI_POUT_TH_RST    0x40
#define RC_ST_RX_ADC_IQ_RST    0x0

__INLINE void rc_agc_cfg_pack(uint8_t agcmapmode, uint8_t agclnard, uint8_t agcbufrd, uint8_t agcpgard, uint8_t tssird, uint8_t stsaradc, uint8_t strxadc, uint8_t txdcn, uint8_t dselva, uint8_t tssipoutth, uint8_t strxadciq)
{
    ASSERT_ERR((((uint32_t)agcmapmode << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)agclnard << 29) & ~((uint32_t)0x60000000)) == 0);
    ASSERT_ERR((((uint32_t)agcbufrd << 28) & ~((uint32_t)0x10000000)) == 0);
    ASSERT_ERR((((uint32_t)agcpgard << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)tssird << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)stsaradc << 14) & ~((uint32_t)0x0000C000)) == 0);
    ASSERT_ERR((((uint32_t)strxadc << 12) & ~((uint32_t)0x00003000)) == 0);
    ASSERT_ERR((((uint32_t)txdcn << 10) & ~((uint32_t)0x00000C00)) == 0);
    ASSERT_ERR((((uint32_t)dselva << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)tssipoutth << 1) & ~((uint32_t)0x000001FE)) == 0);
    ASSERT_ERR((((uint32_t)strxadciq << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_PL_WR(RC_AGC_CFG_ADDR,  ((uint32_t)agcmapmode << 31) | ((uint32_t)agclnard << 29) | ((uint32_t)agcbufrd << 28) | ((uint32_t)agcpgard << 24) | ((uint32_t)tssird << 16) | ((uint32_t)stsaradc << 14) | ((uint32_t)strxadc << 12) | ((uint32_t)txdcn << 10) | ((uint32_t)dselva << 9) | ((uint32_t)tssipoutth << 1) | ((uint32_t)strxadciq << 0));
}

__INLINE void rc_agc_cfg_unpack(uint8_t *agcmapmode, uint8_t *agclnard, uint8_t *agcbufrd, uint8_t *agcpgard, uint8_t *tssird, uint8_t *stsaradc, uint8_t *strxadc, uint8_t *txdcn, uint8_t *dselva, uint8_t *tssipoutth, uint8_t *strxadciq)
{
    uint32_t localVal = REG_PL_RD(RC_AGC_CFG_ADDR);

