china-djyos/djyos/third/firmware/bk7251drv3.0/driver/common/reg/reg_rc.h
__INLINE void rc_trx_spi_intlv_unpack(uint8_t *trxbankrpt, uint16_t *trxspiintlv)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_SPI_INTLV_ADDR);

    *trxbankrpt = (localVal & ((uint32_t)0x80000000)) >> 31;
    *trxspiintlv = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint8_t rc_trx_bank_rpt_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_SPI_INTLV_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE uint16_t rc_trx_spi_intlv_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_TRX_SPI_INTLV_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rc_trx_spi_intlv_setf(uint16_t trxspiintlv)
{
    ASSERT_ERR((((uint32_t)trxspiintlv << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_PL_WR(RC_TRX_SPI_INTLV_ADDR, (uint32_t)trxspiintlv << 0);
}

/**
 * @brief ADDA_REG0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG0   0x0
 * </pre>
 */
#define RC_ADDA_REG0_ADDR   (REG_RC_BASE_ADDR + 0x00000190)
#define RC_ADDA_REG0_OFFSET 0x00000190
#define RC_ADDA_REG0_INDEX  0x00000064
#define RC_ADDA_REG0_RESET  0x00000000

__INLINE uint32_t rc_adda_reg0_get(void)
{
    return REG_PL_RD(RC_ADDA_REG0_ADDR);
}

__INLINE void rc_adda_reg0_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG0_ADDR, value);
}

// field definitions
#define RC_ADDA_REG0_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG0_LSB    0
#define RC_ADDA_REG0_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG0_RST    0x0

__INLINE uint32_t rc_adda_reg0_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg0_setf(uint32_t addareg0)
{
    ASSERT_ERR((((uint32_t)addareg0 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG0_ADDR, (uint32_t)addareg0 << 0);
}

/**
 * @brief ADDA_REG1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG1   0x0
 * </pre>
 */
#define RC_ADDA_REG1_ADDR   (REG_RC_BASE_ADDR + 0x00000194)
#define RC_ADDA_REG1_OFFSET 0x00000194
#define RC_ADDA_REG1_INDEX  0x00000065
#define RC_ADDA_REG1_RESET  0x00000000

__INLINE uint32_t rc_adda_reg1_get(void)
{
    return REG_PL_RD(RC_ADDA_REG1_ADDR);
}

__INLINE void rc_adda_reg1_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG1_ADDR, value);
}

// field definitions
#define RC_ADDA_REG1_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG1_LSB    0
#define RC_ADDA_REG1_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG1_RST    0x0

__INLINE uint32_t rc_adda_reg1_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg1_setf(uint32_t addareg1)
{
    ASSERT_ERR((((uint32_t)addareg1 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG1_ADDR, (uint32_t)addareg1 << 0);
}

/**
 * @brief ADDA_REG2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG2   0x0
 * </pre>
 */
#define RC_ADDA_REG2_ADDR   (REG_RC_BASE_ADDR + 0x00000198)
#define RC_ADDA_REG2_OFFSET 0x00000198
#define RC_ADDA_REG2_INDEX  0x00000066
#define RC_ADDA_REG2_RESET  0x00000000

__INLINE uint32_t rc_adda_reg2_get(void)
{
    return REG_PL_RD(RC_ADDA_REG2_ADDR);
}

__INLINE void rc_adda_reg2_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG2_ADDR, value);
}

// field definitions
#define RC_ADDA_REG2_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG2_LSB    0
#define RC_ADDA_REG2_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG2_RST    0x0

__INLINE uint32_t rc_adda_reg2_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg2_setf(uint32_t addareg2)
{
    ASSERT_ERR((((uint32_t)addareg2 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG2_ADDR, (uint32_t)addareg2 << 0);
}

/**
 * @brief ADDA_REG3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG3   0x0
 * </pre>
 */
#define RC_ADDA_REG3_ADDR   (REG_RC_BASE_ADDR + 0x0000019C)
#define RC_ADDA_REG3_OFFSET 0x0000019C
#define RC_ADDA_REG3_INDEX  0x00000067
#define RC_ADDA_REG3_RESET  0x00000000

__INLINE uint32_t rc_adda_reg3_get(void)
{
    return REG_PL_RD(RC_ADDA_REG3_ADDR);
}

__INLINE void rc_adda_reg3_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG3_ADDR, value);
}

// field definitions
#define RC_ADDA_REG3_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG3_LSB    0
#define RC_ADDA_REG3_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG3_RST    0x0

__INLINE uint32_t rc_adda_reg3_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG3_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg3_setf(uint32_t addareg3)
{
    ASSERT_ERR((((uint32_t)addareg3 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG3_ADDR, (uint32_t)addareg3 << 0);
}

/**
 * @brief ADDA_REG4 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG4   0x0
 * </pre>
 */
#define RC_ADDA_REG4_ADDR   (REG_RC_BASE_ADDR + 0x000001A0)
#define RC_ADDA_REG4_OFFSET 0x000001A0
#define RC_ADDA_REG4_INDEX  0x00000068
#define RC_ADDA_REG4_RESET  0x00000000

__INLINE uint32_t rc_adda_reg4_get(void)
{
    return REG_PL_RD(RC_ADDA_REG4_ADDR);
}

__INLINE void rc_adda_reg4_set(uint32_t value)
{
    REG_PL_WR(RC_ADDA_REG4_ADDR, value);
}

// field definitions
#define RC_ADDA_REG4_MASK   ((uint32_t)0xFFFFFFFF)
#define RC_ADDA_REG4_LSB    0
#define RC_ADDA_REG4_WIDTH  ((uint32_t)0x00000020)

#define RC_ADDA_REG4_RST    0x0

__INLINE uint32_t rc_adda_reg4_getf(void)
{
    uint32_t localVal = REG_PL_RD(RC_ADDA_REG4_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rc_adda_reg4_setf(uint32_t addareg4)
{
    ASSERT_ERR((((uint32_t)addareg4 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_PL_WR(RC_ADDA_REG4_ADDR, (uint32_t)addareg4 << 0);
}

/**
 * @brief ADDA_REG5 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            ADDA_REG5   0x0
 * </pre>
 */
#define RC_ADDA_REG5_ADDR   (REG_RC_BASE_ADDR + 0x000001A4)
#define RC_ADDA_REG5_OFFSET 0x000001A4
#define RC_ADDA_REG5_INDEX  0x00000069
#define RC_ADDA_REG5_RESET  0x00000000

